/**
 * 
 * 1. Хоёр багийн дундаж оноог олно уу. ( A team - 96, 108, 89; B team - 88, 91, 110 )
 * 2. Багийн дундаж нөгөө багийхаас их бол тэр баг түрүүлсэн гэж хэвлэнэ үү. Багуудын оноо тэнцсэн тохиолдолд багууд тэнцсэн гэж хэвлэнэ үү.
 * Энэ дүрэм нь зөвхөн багийн дундаж 100 аас багагүй тохиолдолд энэхүү дүрэм хэрэгжэхийг анхаарна уу. Хэрвээ 2 баг 2 уулаа 100 аас бага * тохиолдолд ялагч байхгүй. Тус бүрийн нөхцөлийг оноог өөрчилж туршиж үзээрэй.
 */


let a = 96, b = 108, c = 89;

let aTeam = (a + b + c)/2
console.log(aTeam)


let d = 88, e = 91, f = 110;

let bTeam = (d + e + f) / 2;
console.log(bTeam)

if (aTeam > bTeam && aTeam > 100){
    console.log("A Team түрүүлсэн")
} else if (aTeam < bTeam && bTeam > 100 ){
    console.log('B Team түрүүлсэн')
} else {
    console.log('Ялагч байхгүй')
}


