// 1. 4 н хувьсагч зарлан тоон утга өг.Өгөгдсөн 4 тооны 80-аас их тоонуудын нийлбэрийг ол.:
// a=85 b=75 c=96 d=69
// 80-аас их тоонуудын нийлбэрийг: 181

let a = 85, b = 75, c = 96, d = 69;
let a1, b1, c1, d1 = ""

if(80 < a){
    a1 = a;
} else {
    a = 0;
    a1 = a;
}

if(80 < b){
    b1 = b;
} else {
    b = 0;
    b1 = b;
}

if(80 < c){
    c1 = c;
} else {
    c = 0;
    c1 = c;
}

if (80 < d){
    d1 = d;
} else {
    d = 0;
    d1 = d;
}

console.log(a1)
console.log(b1)
console.log(c1)
console.log(d1)

console.log(a1 + b1 + c1 + d1)

// 2. 4 н хувьсагч зарлан тоон утга өг. Өгөгдсөн 4 тооны 5-аас бага тоонуудын үржвэрийг ол. 5-аас бага тоо ядаж 1 байгаа:
// a=3 b=7 c=2 d=4 
// 5-аас бага тоонуудын үржвэр: 24

let e = 3; f = 7; g = 2 ; h = 4;
let e1, f1, g1, h1 = "";

if(5 > e){
    e1 = e
} else {
    e = 1;
    e1 = e;
}

if(5 > f){
    f1 = f
} else {
    f = 1;
    f1 = f;
}

if(5 > g){
    g1 = g
} else {
    g = 1;
    g1 = g;
}

if(5 > h){
    h1 = h;
} else {
    h = 1;
    h1 = h;
}

console.log(e1 * f1 * g1 * h1)

